DOWNLOAD THE DATA

In [1]:
# Download the data
!wget -O insurance.csv https://www.dropbox.com/s/mwgqgjbmfw0xa5p/insurance.csv?dl=0

--2021-12-01 04:39:12--  https://www.dropbox.com/s/mwgqgjbmfw0xa5p/insurance.csv?dl=0
Resolving www.dropbox.com (www.dropbox.com)... 162.125.3.18, 2620:100:6018:18::a27d:312
Connecting to www.dropbox.com (www.dropbox.com)|162.125.3.18|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: /s/raw/mwgqgjbmfw0xa5p/insurance.csv [following]
--2021-12-01 04:39:13--  https://www.dropbox.com/s/raw/mwgqgjbmfw0xa5p/insurance.csv
Reusing existing connection to www.dropbox.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com/cd/0/inline/Ba8dbAnfIApbD3ryqbt7oRYwQXgn5Ws5g8KS0zj17yr3x7HQdsphzwFGtqHFVKMFxo7mHx40N6rZKdeJJ1mJcIdh3gU-53oZTjXDbQZ9ErUa1xRO660w_rzbeLjHXmKI8Vfv3g7saycTZD7LyIejvR-6/file# [following]
--2021-12-01 04:39:13--  https://uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com/cd/0/inline/Ba8dbAnfIApbD3ryqbt7oRYwQXgn5Ws5g8KS0zj17yr3x7HQdsphzwFGtqHFVKMFxo7mHx40N6rZKdeJJ1mJcIdh3gU-53oZTjXDbQZ9ErUa1xRO660w_rzbeLjHXmKI8Vfv3g7saycTZD7LyIejvR-6/file
Resolving uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com (uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com)... 162.125.3.15, 2620:100:6020:15::a27d:400f
Connecting to uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com (uc3583f626f5647dfc9db3f5dbc7.dl.dropboxusercontent.com)|162.125.3.15|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 55628 (54K) [text/plain]
Saving to: ‘insurance.csv’

insurance.csv       100%[===================>]  54.32K  --.-KB/s    in 0.04s

2021-12-01 04:39:13 (1.45 MB/s) - ‘insurance.csv’ saved [55628/55628]

Import the Library

In [2]:
import numpy as np          # used for mathmatical functions
import matplotlib.pyplot as plt       #used for ploting
import pandas as pd

Observe the data

In [3]:
dataset = pd.read_csv('insurance.csv')
dataset

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [4]:
dataset.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

Target and Feature data

In [5]:
target = dataset[['charges']]
features = dataset[['age', 'sex', 'bmi', 'smoker','region']]

In [6]:
target

          charges
0     16884.92400
1      1725.55230
2      4449.46200
3     21984.47061
4      3866.85520
...           ...
1333  10600.54830
1334   2205.98080
1335   1629.83350
1336   2007.94500
1337  29141.36030

[1338 rows x 1 columns]

In [7]:
features

      age     sex     bmi smoker     region
0      19  female  27.900    yes  southwest
1      18    male  33.770     no  southeast
2      28    male  33.000     no  southeast
3      33    male  22.705     no  northwest
4      32    male  28.880     no  northwest
...   ...     ...     ...    ...        ...
1333   50    male  30.970     no  northwest
1334   18  female  31.920     no  northeast
1335   18  female  36.850     no  southeast
1336   21  female  25.800     no  southwest
1337   61  female  29.070    yes  northwest

[1338 rows x 5 columns]

In [8]:
features['region'].value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

Checking the Datasets

In [9]:
target.isnull()

      charges
0       False
1       False
2       False
3       False
4       False
...       ...
1333    False
1334    False
1335    False
1336    False
1337    False

[1338 rows x 1 columns]

In [10]:
features.isnull()

        age    sex    bmi  smoker  region
0     False  False  False   False   False
1     False  False  False   False   False
2     False  False  False   False   False
3     False  False  False   False   False
4     False  False  False   False   False
...     ...    ...    ...     ...     ...
1333  False  False  False   False   False
1334  False  False  False   False   False
1335  False  False  False   False   False
1336  False  False  False   False   False
1337  False  False  False   False   False

[1338 rows x 5 columns]

In [11]:
features.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     1338 non-null   int64
 1   sex     1338 non-null   object
 2   bmi     1338 non-null   float64
 3   smoker  1338 non-null   object
 4   region  1338 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 52.4+ KB

In [12]:
target.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   charges  1338 non-null   float64
dtypes: float64(1)
memory usage: 10.6 KB

No Null Data is Present in Features and Target Dataframe

Coverting the categorical data to numerical data

In [ ]:
from sklearn.preprocessing import LabelEncoder
labelencoder_f = LabelEncoder()
features['sex'] = labelencoder_f.fit_transform(features['sex'])
features['smoker'] = labelencoder_f.fit_transform(features['smoker'])
features['region'] = labelencoder_f.fit_transform(features['region'])
# 0 for female and 1 for male
#1 for yes and 0 for no
#for southeast "2"   northwest "1"   southwest  "3"  northeast    "0"
features

prepare the dataset and split it into test and train data

In [32]:
features

      age  sex     bmi  smoker  region
0      19    0  27.900       1       3
1      18    1  33.770       0       2
2      28    1  33.000       0       2
3      33    1  22.705       0       1
4      32    1  28.880       0       1
...   ...  ...     ...     ...     ...
1333   50    1  30.970       0       1
1334   18    0  31.920       0       0
1335   18    0  36.850       0       2
1336   21    0  25.800       0       3
1337   61    0  29.070       1       1

[1338 rows x 5 columns]

In [31]:
target

          charges
0     16884.92400
1      1725.55230
2      4449.46200
3     21984.47061
4      3866.85520
...           ...
1333  10600.54830
1334   2205.98080
1335   1629.83350
1336   2007.94500
1337  29141.36030

[1338 rows x 1 columns]

In [33]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(features,target,test_size=0.1,random_state=0)
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(1204, 5)
(134, 5)
(1204, 1)
(134, 1)

In [34]:
X_train

      age  sex    bmi  smoker  region
461    42    1  30.00       1       3
322    34    1  30.80       1       3
224    42    1  24.64       1       2
711    50    0  23.54       0       2
58     53    0  22.88       1       2
...   ...  ...    ...     ...     ...
763    27    1  26.03       0       0
835    42    1  35.97       0       2
1216   40    1  25.08       0       2
559    19    1  35.53       0       1
684    33    0  18.50       0       3

[1204 rows x 5 columns]

In [35]:
X_test

      age  sex     bmi  smoker  region
578    52    1  30.200       0       3
610    47    0  29.370       0       2
569    48    1  40.565       1       1
1034   61    1  38.380       0       1
198    51    0  18.050       0       1
...   ...  ...     ...     ...     ...
787    21    1  36.860       0       1
823    44    0  29.810       0       2
1      18    1  33.770       0       2
589    38    0  30.690       0       2
512    51    1  22.420       0       0

[134 rows x 5 columns]

Feature Scalling

In [19]:
from sklearn.preprocessing import StandardScaler
X_sc = StandardScaler()
X_train = X_sc.fit_transform(X_train)
X_test = X_sc.transform(X_test)

Measure the Accuracy with different model

Linear regression

In [20]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()
regressor.fit(X_train,y_train)
# Predicting the Test Set Results
y_pred = regressor.predict(X_test)

Evaluation Metrices

In [21]:
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
mean_absolute_error(y_test, y_pred)
mean_squared_error(y_test, y_pred)
r2_score(y_test, y_pred)

0.8190607856854224

In [22]:
mean_absolute_error(y_test, y_pred)

4250.331194165464

In [23]:
mean_squared_error(y_test, y_pred)

35084737.15083078

In [24]:
r2_score(y_test, y_pred)

0.8190607856854224

Fit different model

Feature Scaling

In [36]:
from sklearn.preprocessing import StandardScaler
X_sc = StandardScaler()
y_sc = StandardScaler()
X_train_new = X_sc.fit_transform(X_train[['age',	'sex',	'bmi', 'smoker', 'region']])
X_test_new = X_sc.transform(X_test[['age',	'sex',	'bmi', 'smoker', 'region']])
y_train_new = y_sc.fit_transform(y_train[['charges']])
y_test_new = y_sc.transform(y_test[['charges']])

Support Vector Regression

In [38]:
from sklearn.svm import SVR 
regressor = SVR(kernel = 'linear')
regressor.fit(X_train_new,y_train_new)

/usr/local/lib/python3.7/dist-packages/sklearn/utils/validation.py:985: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

SVR(kernel='linear')

In [39]:
y_pred = regressor.predict(X_test_new)

In [40]:
r2_score(y_test_new, y_pred)

0.8010198441940589

Decision Tree Regression

In [42]:
from sklearn.tree import DecisionTreeRegressor
regressor = DecisionTreeRegressor(random_state = 0)
regressor.fit(X_train_new,y_train_new)
y_pred = regressor.predict(X_test_new)
r2_score(y_test_new, y_pred)

0.7097488580367087

Random Forest Regression

In [43]:
from sklearn.ensemble import RandomForestRegressor
regressor = RandomForestRegressor(n_estimators = 10,random_state = 0) 
regressor.fit(X_train_new,y_train_new)
y_pred = regressor.predict(X_test_new)
r2_score(y_test_new, y_pred)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  This is separate from the ipykernel package so we can avoid doing imports until

0.8748730488150689